#### MySQL Exercise 12: Queries that Test Relationships Between Test Completion and Testing Circumstances

#### To begin, load the sql library and database, and make the Dognition database your default database:

####  During which weekdays do Dognition users complete the most tests?

In [1]:
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/dognitiondb
%sql USE dognitiondb

0 rows affected.

[]

#### Question 1: Using the function you found in the websites above, write a query that will output one column with the original created_at time stamp from each row in the completed_tests table, and another column with a number that represents the day of the week associated with each of those time stamps. Limit your output to 200 rows starting at row 50.

In [2]:
%%sql
SELECT created_at, DAYOFWEEK(created_at)
FROM complete_tests
LIMIT 49,10;

10 rows affected.

[(datetime.datetime(2013, 2, 5, 22, 10, 6), 3),
 (datetime.datetime(2013, 2, 5, 22, 23, 49), 3),
 (datetime.datetime(2013, 2, 5, 22, 26, 36), 3),
 (datetime.datetime(2013, 2, 5, 22, 29, 2), 3),
 (datetime.datetime(2013, 2, 5, 22, 32, 25), 3),
 (datetime.datetime(2013, 2, 5, 22, 33, 9), 3),
 (datetime.datetime(2013, 2, 5, 22, 36, 11), 3),
 (datetime.datetime(2013, 2, 5, 22, 38, 1), 3),
 (datetime.datetime(2013, 2, 5, 22, 48, 58), 3),
 (datetime.datetime(2013, 2, 5, 22, 53, 45), 3)]

#### Question 2: Include a CASE statement in the query you wrote in Question 1 to output a third column that provides the weekday name (or an appropriate abbreviation) associated with each created_at time stamp.

In [3]:
%%sql
SELECT created_at, DAYOFWEEK(created_at),
(CASE
WHEN DAYOFWEEK(created_at)=1 THEN "Su"
WHEN DAYOFWEEK(created_at)=2 THEN "Mo"
WHEN DAYOFWEEK(created_at)=3 THEN "Tu"
WHEN DAYOFWEEK(created_at)=4 THEN "We"
WHEN DAYOFWEEK(created_at)=5 THEN "Th"
WHEN DAYOFWEEK(created_at)=6 THEN "Fr"
WHEN DAYOFWEEK(created_at)=7 THEN "Sa"
END) AS daylabel
FROM complete_tests
LIMIT 49,10;

10 rows affected.

[(datetime.datetime(2013, 2, 5, 22, 10, 6), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 23, 49), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 26, 36), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 29, 2), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 32, 25), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 33, 9), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 36, 11), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 38, 1), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 48, 58), 3, 'Tu'),
 (datetime.datetime(2013, 2, 5, 22, 53, 45), 3, 'Tu')]

#### Question 3: Adapt the query you wrote in Question 2 to report the total number of tests completed on each weekday. Sort the results by the total number of tests completed in descending order. You should get a total of 33,190 tests in the Sunday row of your output.

In [4]:
%%sql
SELECT DAYOFWEEK(created_at),COUNT(created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(created_at)=1 THEN "Su"
WHEN DAYOFWEEK(created_at)=2 THEN "Mo"
WHEN DAYOFWEEK(created_at)=3 THEN "Tu"
WHEN DAYOFWEEK(created_at)=4 THEN "We"
WHEN DAYOFWEEK(created_at)=5 THEN "Th"
WHEN DAYOFWEEK(created_at)=6 THEN "Fr"
WHEN DAYOFWEEK(created_at)=7 THEN "Sa"
END) AS daylabel
FROM complete_tests
GROUP BY daylabel
ORDER BY numtests DESC;

7 rows affected.

[(1, 33190, 'Su'),
 (2, 30195, 'Mo'),
 (3, 27989, 'Tu'),
 (7, 27899, 'Sa'),
 (4, 26473, 'We'),
 (5, 24420, 'Th'),
 (6, 23080, 'Fr')]

#### Question 4: Rewrite the query in Question 3 to exclude the dog_guids that have a value of "1" in the exclude column (Hint: this query will require a join.) This time you should get a total of 31,092 tests in the Sunday row of your output.

In [5]:
%%sql
SELECT DAYOFWEEK(c.created_at),COUNT(c.created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(c.created_at)=1 THEN "Su"
WHEN DAYOFWEEK(c.created_at)=2 THEN "Mo"
WHEN DAYOFWEEK(c.created_at)=3 THEN "Tu"
WHEN DAYOFWEEK(c.created_at)=4 THEN "We"
WHEN DAYOFWEEK(c.created_at)=5 THEN "Th"
WHEN DAYOFWEEK(c.created_at)=6 THEN "Fr"
WHEN DAYOFWEEK(c.created_at)=7 THEN "Sa"
END) AS daylabel
FROM complete_tests c JOIN dogs d
ON c.dog_guid=d.dog_guid
WHERE d.exclude IS NULL OR d.exclude=0
GROUP BY daylabel
ORDER BY numtests DESC;

7 rows affected.

[(1, 31092, 'Su'),
 (2, 28250, 'Mo'),
 (7, 26231, 'Sa'),
 (3, 25764, 'Tu'),
 (4, 24501, 'We'),
 (5, 22347, 'Th'),
 (6, 21028, 'Fr')]

#### Question 5: Write a query to retrieve all the dog_guids for users common to the dogs and users table using the traditional inner join syntax (your output will have 950,331 rows).

In [6]:
%%sql
SELECT dog_guid
FROM dogs d INNER JOIN users u
ON d.user_guid=u.user_guid
LIMIT 10;

10 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b272-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b',)]

#### Question 6: Write a query to retrieve all the distinct dog_guids common to the dogs and users table using the traditional inner join syntax (your output will have 35,048 rows).

In [7]:
%%sql
SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
LIMIT 10;

10 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27ba1a-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27bbbe-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27c1c2-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b',)]

#### Question 7: Start by writing a query that retrieves distinct dog_guids common to the dogs and users table, excuding dog_guids and user_guids with a "1" in their respective exclude columns (your output will have 34,121 rows).

In [8]:
%%sql
SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE (u.exclude IS NULL OR u.exclude=0) AND (d.exclude IS NULL OR
d.exclude=0)
LIMIT 10;

10 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27bbbe-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27c1c2-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27c74e-7144-11e5-ba71-058fbc01cf0b',),
 ('fd27c7d0-7144-11e5-ba71-058fbc01cf0b',)]

#### Question 8: Now adapt your query from Question 4 so that it inner joins on the result of the subquery you wrote in Question 7 instead of the dogs table. This will give you a count of the number of tests completed on each day of the week, excluding all of the dog_guids and user_guids that the Dognition team flagged in the exclude columns.

In [9]:
%%sql
SELECT DAYOFWEEK(c.created_at) AS dayasnum, YEAR(c.created_at) AS year,
COUNT(c.created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(c.created_at)=1 THEN "Su"
WHEN DAYOFWEEK(c.created_at)=2 THEN "Mo"
WHEN DAYOFWEEK(c.created_at)=3 THEN "Tu"
WHEN DAYOFWEEK(c.created_at)=4 THEN "We"
WHEN DAYOFWEEK(c.created_at)=5 THEN "Th"
WHEN DAYOFWEEK(c.created_at)=6 THEN "Fr"
WHEN DAYOFWEEK(c.created_at)=7 THEN "Sa"
END) AS daylabel
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY daylabel
ORDER BY numtests DESC;

7 rows affected.

[(1, 2013, 31036, 'Su'),
 (2, 2013, 28138, 'Mo'),
 (7, 2013, 26149, 'Sa'),
 (3, 2013, 25696, 'Tu'),
 (4, 2013, 24433, 'We'),
 (5, 2014, 22323, 'Th'),
 (6, 2013, 21027, 'Fr')]

#### Question 9: Adapt your query from Question 8 to provide a count of the number of tests completed on each weekday of each year in the Dognition data set. Exclude all dog_guids and user_guids with a value of "1" in their exclude columns. Sort the output by year in ascending order, and then by the total number of tests completed in descending order.

In [10]:
%%sql SELECT DAYOFWEEK(c.created_at) AS dayasnum, YEAR(c.created_at) AS
year, COUNT(c.created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(c.created_at)=1 THEN "Su"
WHEN DAYOFWEEK(c.created_at)=2 THEN "Mo"
WHEN DAYOFWEEK(c.created_at)=3 THEN "Tu"
WHEN DAYOFWEEK(c.created_at)=4 THEN "We"
WHEN DAYOFWEEK(c.created_at)=5 THEN "Th"
WHEN DAYOFWEEK(c.created_at)=6 THEN "Fr"
WHEN DAYOFWEEK(c.created_at)=7 THEN "Sa"
END) AS daylabel
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY year,daylabel
ORDER BY year ASC, numtests DESC;

21 rows affected.

[(1, 2013, 8203, 'Su'),
 (7, 2013, 6854, 'Sa'),
 (2, 2013, 5740, 'Mo'),
 (4, 2013, 5665, 'We'),
 (3, 2013, 5393, 'Tu'),
 (6, 2013, 4997, 'Fr'),
 (5, 2013, 4961, 'Th'),
 (2, 2014, 9309, 'Mo'),
 (1, 2014, 9210, 'Su'),
 (3, 2014, 9177, 'Tu'),
 (4, 2014, 8857, 'We'),
 (7, 2014, 8257, 'Sa'),
 (5, 2014, 7286, 'Th'),
 (6, 2014, 6475, 'Fr'),
 (1, 2015, 13623, 'Su'),
 (2, 2015, 13089, 'Mo'),
 (3, 2015, 11126, 'Tu'),
 (7, 2015, 11038, 'Sa'),
 (5, 2015, 10076, 'Th'),
 (4, 2015, 9911, 'We'),
 (6, 2015, 9555, 'Fr')]

#### Question 10: First, adapt your query from Question 9 so that you only examine customers located in the United States, with Hawaii and Alaska residents excluded. HINTS: In this data set, the abbreviation for the United States is "US", the abbreviation for Hawaii is "HI" and the abbreviation for Alaska is "AK". You should have 5,860 tests completed on Sunday of 2013.

In [11]:
%%sql
SELECT DAYOFWEEK(c.created_at) AS dayasnum, YEAR(c.created_at) AS year,
COUNT(c.created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(c.created_at)=1 THEN "Su"
WHEN DAYOFWEEK(c.created_at)=2 THEN "Mo"
WHEN DAYOFWEEK(c.created_at)=3 THEN "Tu"
WHEN DAYOFWEEK(c.created_at)=4 THEN "We"
WHEN DAYOFWEEK(c.created_at)=5 THEN "Th"
WHEN DAYOFWEEK(c.created_at)=6 THEN "Fr"
WHEN DAYOFWEEK(c.created_at)=7 THEN "Sa"
END) AS daylabel
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND u.country="US"
AND (u.state!="HI" AND u.state!="AK")
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY year,daylabel
ORDER BY year ASC, numtests DESC;

21 rows affected.

[(1, 2013, 5860, 'Su'),
 (7, 2013, 4674, 'Sa'),
 (2, 2013, 3695, 'Mo'),
 (4, 2013, 3496, 'We'),
 (3, 2013, 3449, 'Tu'),
 (6, 2013, 3163, 'Fr'),
 (5, 2013, 3090, 'Th'),
 (2, 2014, 7278, 'Mo'),
 (3, 2014, 6800, 'Tu'),
 (1, 2014, 6632, 'Su'),
 (4, 2014, 6331, 'We'),
 (7, 2014, 6006, 'Sa'),
 (5, 2014, 5271, 'Th'),
 (6, 2014, 4831, 'Fr'),
 (2, 2015, 8784, 'Mo'),
 (1, 2015, 8570, 'Su'),
 (3, 2015, 7218, 'Tu'),
 (7, 2015, 7116, 'Sa'),
 (5, 2015, 6343, 'Th'),
 (4, 2015, 6164, 'We'),
 (6, 2015, 5689, 'Fr')]

#### Question 11: Write a query that extracts the original created_at time stamps for rows in the complete_tests table in one column, and the created_at time stamps with 6 hours subtracted in another column. Limit your output to 100 rows.

In [12]:
%%sql
SELECT created_at, DATE_SUB(created_at, interval 6 hour) AS corrected_time
FROM complete_tests
LIMIT 10;

10 rows affected.

[(datetime.datetime(2013, 2, 5, 18, 26, 54), datetime.datetime(2013, 2, 5, 12, 26, 54)),
 (datetime.datetime(2013, 2, 5, 18, 31, 3), datetime.datetime(2013, 2, 5, 12, 31, 3)),
 (datetime.datetime(2013, 2, 5, 18, 32, 4), datetime.datetime(2013, 2, 5, 12, 32, 4)),
 (datetime.datetime(2013, 2, 5, 18, 32, 25), datetime.datetime(2013, 2, 5, 12, 32, 25)),
 (datetime.datetime(2013, 2, 5, 18, 32, 56), datetime.datetime(2013, 2, 5, 12, 32, 56)),
 (datetime.datetime(2013, 2, 5, 18, 33, 15), datetime.datetime(2013, 2, 5, 12, 33, 15)),
 (datetime.datetime(2013, 2, 5, 18, 33, 33), datetime.datetime(2013, 2, 5, 12, 33, 33)),
 (datetime.datetime(2013, 2, 5, 18, 33, 59), datetime.datetime(2013, 2, 5, 12, 33, 59)),
 (datetime.datetime(2013, 2, 5, 18, 34, 25), datetime.datetime(2013, 2, 5, 12, 34, 25)),
 (datetime.datetime(2013, 2, 5, 18, 34, 39), datetime.datetime(2013, 2, 5, 12, 34, 39))]

#### Question 12: Use your query from Question 11 to adapt your query from Question 10 in order to provide a count of the number of tests completed on each day of the week, with approximate time zones taken into account, in each year in the Dognition data set. Exclude all dog_guids and user_guids with a value of "1" in their exclude columns. Sort the output by year in ascending order, and then by the total number of tests completed in descending order. HINT: Don't forget to adjust for the time zone in your DAYOFWEEK statement and your CASE statement.

In [13]:
%%sql
SELECT DAYOFWEEK(DATE_SUB(created_at, interval 6 hour)) AS dayasnum,
YEAR(c.created_at) AS year, COUNT(c.created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=1 THEN "Su"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=2 THEN "Mo"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=3 THEN "Tu"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=4 THEN "We"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=5 THEN "Th"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=6 THEN "Fr"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=7 THEN "Sa"
END) AS daylabel
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND u.country="US"
AND (u.state!="HI" AND u.state!="AK")
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY year,daylabel
ORDER BY year ASC, numtests DESC;

21 rows affected.

[(1, 2013, 6061, 'Su'),
 (7, 2013, 4754, 'Sa'),
 (2, 2013, 3798, 'Mo'),
 (4, 2013, 3410, 'We'),
 (3, 2013, 3276, 'Tu'),
 (5, 2013, 3079, 'Th'),
 (6, 2013, 3049, 'Fr'),
 (2, 2014, 7908, 'Mo'),
 (1, 2014, 7736, 'Su'),
 (3, 2014, 6513, 'Tu'),
 (7, 2014, 6081, 'Sa'),
 (4, 2014, 5772, 'We'),
 (5, 2014, 4800, 'Th'),
 (6, 2014, 4339, 'Fr'),
 (1, 2015, 10406, 'Su'),
 (2, 2015, 8229, 'Mo'),
 (7, 2015, 7154, 'Sa'),
 (3, 2015, 6673, 'Tu'),
 (4, 2015, 6266, 'We'),
 (5, 2015, 5881, 'Th'),
 (6, 2015, 5275, 'Fr')]

#### Question 13: Adapt your query from Question 12 so that the results are sorted by year in ascending order, and then by the day of the week in the following order: Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday

In [14]:
%%sql
SELECT DAYOFWEEK(DATE_SUB(created_at, interval 6 hour)) AS dayasnum,
YEAR(c.created_at) AS year, COUNT(c.created_at) AS numtests,
(CASE
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=1 THEN "Su"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=2 THEN "Mo"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=3 THEN "Tu"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=4 THEN "We"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=5 THEN "Th"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=6 THEN "Fr"
WHEN DAYOFWEEK(DATE_SUB(created_at, interval 6 hour))=7 THEN "Sa"
END) AS daylabel
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND u.country="US"
AND (u.state!="HI" AND u.state!="AK")
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY year,daylabel
ORDER BY year ASC, FIELD(daylabel,'Mo','Tu','We','Th','Fr','Sa','Su');

21 rows affected.

[(2, 2013, 3798, 'Mo'),
 (3, 2013, 3276, 'Tu'),
 (4, 2013, 3410, 'We'),
 (5, 2013, 3079, 'Th'),
 (6, 2013, 3049, 'Fr'),
 (7, 2013, 4754, 'Sa'),
 (1, 2013, 6061, 'Su'),
 (2, 2014, 7908, 'Mo'),
 (3, 2014, 6513, 'Tu'),
 (4, 2014, 5772, 'We'),
 (5, 2014, 4800, 'Th'),
 (6, 2014, 4339, 'Fr'),
 (7, 2014, 6081, 'Sa'),
 (1, 2014, 7736, 'Su'),
 (2, 2015, 8229, 'Mo'),
 (3, 2015, 6673, 'Tu'),
 (4, 2015, 6266, 'We'),
 (5, 2015, 5881, 'Th'),
 (6, 2015, 5275, 'Fr'),
 (7, 2015, 7154, 'Sa'),
 (1, 2015, 10406, 'Su')]

#### Which states and countries have the most Dognition users?

#### Question 14: Which 5 states within the United States have the most Dognition customers, once all dog_guids and user_guids with a value of "1" in their exclude columns are removed? Try using the following general strategy: count how many unique user_guids are associated with dogs in the complete_tests table, break up the counts according to state, sort the results by counts of unique user_guids in descending order, and then limit your output to 5 rows. California ("CA") and New York ("NY") should be at the top of your list.

In [15]:
%%sql
SELECT dogs_cleaned.state AS state, COUNT(DISTINCT dogs_cleaned.user_guid) AS
numusers
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid, u.user_guid, u.state
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND u.country="US"
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY state
ORDER BY numusers DESC
LIMIT 5;

5 rows affected.

[('CA', 1363), ('NY', 628), ('TX', 536), ('FL', 502), ('NC', 467)]

#### Question 15: Which 10 countries have the most Dognition customers, once all dog_guids and user_guids with a value of "1" in their exclude columns are removed? HINT: don't forget to remove the u.country="US" statement from your WHERE clause.

In [16]:
%%sql
SELECT dogs_cleaned.country AS country, COUNT(DISTINCT
dogs_cleaned.user_guid) AS numusers
FROM complete_tests c JOIN
(SELECT DISTINCT dog_guid, u.user_guid, u.country
FROM dogs d JOIN users u
ON d.user_guid=u.user_guid
WHERE ((u.exclude IS NULL OR u.exclude=0)
AND (d.exclude IS NULL OR d.exclude=0))) AS dogs_cleaned
ON c.dog_guid=dogs_cleaned.dog_guid
GROUP BY country
ORDER BY numusers DESC
LIMIT 10;

10 rows affected.

[('US', 8936),
 ('N/A', 5466),
 ('CA', 484),
 ('AU', 142),
 ('GB', 123),
 ('DE', 40),
 ('NZ', 38),
 ('DK', 34),
 ('NO', 30),
 ('FR', 23)]